[{"landmark_id": 4, "landmark_name": "- Penmon Point (10.3 Miles)", "modal_link": "L1", "main_image": "penmon-point", "body_text": "hello", "longitude": -4.0415, "latitude": 53.3112}, {"landmark_id": 2, "landmark_name": "- South Stack (72.7 Miles)", "modal_link": "L6", "main_image": "south-stack", "body_text": "<br>South Stack Lighthouse was built on Holy Island, off the Isle of Anglesey, by Daniel Alexandra (engineer) and Joseph Nelson (builder) during 1808-1809.<br><br> The build was initiated by Captain Hugh Evans who was determined to have a lighthouse constructed after collecting facts and figures regarding maritime disasters on the Holy Island coastline and presenting them to the decision-makers of the time in 1807. The build of this now famous 27.7 metre tall South Stack lighthouse was subsequently commissioned on the 30-metre summit of this rocky outcrop.<br><br> As would be expected the weather hindered the operation on many occasion", "longitude": -4.6994, "latitude": 53.3066}, {"landmark_id": 3, "landmark_name": "- Menai Suspension Bridge (19.1 Miles)", "modal_link": "L3", "main_image": "menai-bridge", "body_text": "hgasiyufgasgdbcuaisbc", "longitude": -4.1656, "latitude": 53.2226}, {"landmark_id": 1, "landmark_name": "- Beaumaris Castle (14.4)", "modal_link": "L2", "main_image": "beaumaris-castle", "body_text": "Beaumaris Castle was built as part of Edward I’s campaign to conquer north Wales after 1282. Plans to construct the castle in 1284 were delayed due to lack of funds and work only began in 1295 following the Madog ap Llywelyn uprising. Beaumaris Castle was taken by Welsh forces in 1403 during the rebellion of Owain Glyndŵr but recaptured by royal forces in 1405. Here are half a dozen interesting facts about Beaumaris Castle:  1. Wales was divided into counties and shires, emulating how England was governed, with three new shires created in the north-west, Caernarfon, Merioneth and Anglesey. New towns with protective castles were established at Caernarfon and Harlech, the administrative centres of the first two shires. Another castle and walled town was built in nearby Conwy and plans were probably made to establish a similar castle and settlement near Llanfaes on Anglesey.<br><br> 2. Beaumaris Gaol is a disused jail located in the castle grounds. Although no longer in use it remains largely unalt", "longitude": -4.0897, "latitude": 53.2648}]