[{"landmark_id": 4, "landmark_name": "- Penmon Point (10.3 Miles)", "modal_link": "L1", "video_link": "fgs", "main_image": "penmon-point", "body_text": "<br>Penmon Point is on the northeast coast of Anglesey. The name Penmon Point derives from Welsh: “pen” (which can mean \"head\", \"end\" or \"promontory\") and “Môn”, the Welsh name for Anglesey. <br><br> Standing on the rocky coastline, on the left, you have the black and white lighthouse, in front, you’ll find Puffin Island and to your right is the Snowdonia National Park mountain range. <br><br> With its unconventional black and white stripes, the Trwyn Du Lighthouse is one of only five working lighthouses on the island of Anglesey and was built in 1838 to mark the north entrance to the Menai Strait.<br><br> If you’re wildlife lovers then Penmon point is a must-visit while on Anglesey. Along with the birds, such as the noisy Turnstones, keep an eye out for seals basking in the sun, bobbing along in the water close to the shore or over on Puffin island relaxing on the sand. Penmon Point is also a great place to spot dolphins and harbour porpoises in summer! <br><br> If you want to see the puffins with their unmistakable colours, and strikingly bright bills then try a Puffin Island tour. Puffin Island, about half a mile offshore, is the ninth-largest island off the Welsh coast. Here you can take a boat trip to explore the seabirds including guillemots, razorbills, kittiwakes, and of course the puffins. The island is of European importance for its breeding population of cormorants and is also an important roosting area for oystercatchers! <br><br> If you’re an expert kayaker and enjoy water sports then you can kayak out to Puffin Island from the mainland. During low tide, you can see a colony of seals who usually inhabit the island resting on the shore or catching fish.<br><br> The sections of the coastal path that covers Penmon Point starts from the village of Moelfre and ends at the town of Beaumaris. This route showcases a dramatic series of limestone cliffs along with the beautiful Red Wharf Bay and views of the Carneddau mountains across the Menai Strait. Along the route and just a 10-minute walk from the lighthouse is a natural sea arch created by the rocks. The colours of the different layers of rocks uncovered here are particularly striking.<br><br>   Enjoy this lovely drone footage of Penmon Point on a calm sunny day: <br>", "longitude": -4.0415, "latitude": 53.3112}, {"landmark_id": 1, "landmark_name": "- Beaumaris Castle (14.4)", "modal_link": "L2", "video_link": "https://www.youtube.com/watch?v=r9tFqEYP7yo&list=RDPZ2zFF-I7e0&index=2", "main_image": "beaumaris-castle", "body_text": "Beaumaris Castle was built as part of Edward I’s campaign to conquer north Wales after 1282. Plans to construct the castle in 1284 were delayed due to lack of funds and work only began in 1295 following the Madog ap Llywelyn uprising. Beaumaris Castle was taken by Welsh forces in 1403 during the rebellion of Owain Glyndŵr but recaptured by royal forces in 1405. Here are half a dozen interesting facts about Beaumaris Castle:  1. Wales was divided into counties and shires, emulating how England was governed, with three new shires created in the north-west, Caernarfon, Merioneth and Anglesey. New towns with protective castles were established at Caernarfon and Harlech, the administrative centres of the first two shires. Another castle and walled town was built in nearby Conwy and plans were probably made to establish a similar castle and settlement near Llanfaes on Anglesey.<br><br> 2. Beaumaris Gaol is a disused jail located in the castle grounds. Although no longer in use it remains largely unalt", "longitude": -4.0897, "latitude": 53.2648}, {"landmark_id": 3, "landmark_name": "- Menai Suspension Bridge (19.1 Miles)", "modal_link": "L3", "video_link": "fthg", "main_image": "menai-bridge", "body_text": "<br>For centuries, travel to Anglesey from the mainland was often hazardous. Ferries traversed the Menai Straits at various places, but the currents are tricky and numerous boats capsized or ran aground, often with loss of life.<br><br> In 1800, Ireland joined the UK through the Act of Union. This meant that the numbers of people wishing to cross the Straits increased as politicians commuted to and from Ireland to parliament in London.<br><br> The route from London to Holyhead became an important roadway, representing a physical link between parliament and Ireland. Although well-travelled, the journey was still notoriously dangerous.<br><br> In 1819, a civil engineer called Thomas Telford began working on ambitious improvements to the journey between London and the port of Holyhead. Recognising the danger to travellers that crossing the Straits involved, Telford designed a ground-breaking piece of civil engineering – the Menai Bridge.<br><br> Completed on 30 January 1826, the Menai Bridge was a triumph of civil engineering – the biggest suspension bridge in the world at the time. Sixteen huge chains held up 579 feet of deck, allowing 100 feet of clear space beneath. This allowed tall sailing ships navigating the seaway to pass underneath, whilst spanning the Straits at its narrowest point.<br><br> The Menai Bridge not only made Telford’s reputation as a civil engineering superhero but also dramatically reduced the time and danger it took to travel from London to Holyhead. Along with Telford’s other improvements to the road, the journey time was cut from 36 to 27 hours!<br><br> Fortunately, today’s journey time has been cut even further by Avanti West Coast Trains which cross the Menai Straits on the nearby, larger and more modern double-decker Britannia Bridge.<br><br> The magic of the Menai Suspension Bridge and its sublime surroundings are perfectly captured in this short video:<br>", "longitude": -4.1656, "latitude": 53.2226}, {"landmark_id": 2, "landmark_name": "- South Stack (72.7 Miles)", "modal_link": "L6", "video_link": "f0iZgK1BQN4", "main_image": "south-stack", "body_text": "<br>South Stack Lighthouse was built on Holy Island, off the Isle of Anglesey, by Daniel Alexandra (engineer) and Joseph Nelson (builder) during 1808-1809.<br><br> The build was initiated by Captain Hugh Evans who was determined to have a lighthouse constructed after collecting facts and figures regarding maritime disasters on the Holy Island coastline and presenting them to the decision-makers of the time in 1807. The build of this now famous 27.7 metre tall South Stack lighthouse was subsequently commissioned on the 30-metre summit of this rocky outcrop.<br><br> As would be expected the weather hindered the operation on many occasion", "longitude": -4.6994, "latitude": 53.3066}]